; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v6 - type_2 ?v3 - type_1)
 	      (pred_2 ?v8 - object ?v3 - type_1)
	      (pred_3 ?v6 - type_2 ?v7 - type_3)
	      (pred_4 ?v6 - type_2 ?v8 - object ?v7 - type_3))

   (:action op_2
       :parameters  (?v6 - type_2 ?v4 ?v1 - type_1)
       :precondition (and  (pred_1 ?v6 ?v4))
       :effect (and  (pred_1 ?v6 ?v1)
		     (not (pred_1 ?v6 ?v4))))

   (:action op_1
       :parameters (?v6 - type_2 ?v2 - object ?v5 - type_1 ?v7 - type_3)
       :precondition  (and  (pred_2 ?v2 ?v5) (pred_1 ?v6 ?v5) (pred_3 ?v6 ?v7))
       :effect (and (pred_4 ?v6 ?v2 ?v7)
		    (not (pred_2 ?v2 ?v5)) 
		    (not (pred_3 ?v6 ?v7))))

   (:action op_3
       :parameters (?v6 - type_2 ?v2 - object ?v5 - type_1 ?v7 - type_3)
       :precondition  (and  (pred_4 ?v6 ?v2 ?v7) (pred_1 ?v6 ?v5))
       :effect (and (pred_2 ?v2 ?v5)
		    (pred_3 ?v6 ?v7)
		    (not (pred_4 ?v6 ?v2 ?v7)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_08 obj_05 - type_2
obj_09 obj_10 obj_11 obj_06 - type_3
obj_02 obj_07 obj_01 - type_1
obj_12 obj_04 obj_03 - object)
(:init
(pred_1 obj_08 obj_07)
(pred_3 obj_08 obj_09)
(pred_3 obj_08 obj_10)
(pred_1 obj_05 obj_07)
(pred_3 obj_05 obj_11)
(pred_3 obj_05 obj_06)
(pred_2 obj_12 obj_01)
(pred_2 obj_04 obj_07)
(pred_2 obj_03 obj_07)
)
(:goal
(and
(pred_2 obj_12 obj_07)
(pred_2 obj_04 obj_02)
(pred_2 obj_03 obj_01)
)
)

(:constraints
  (always (not (pred_1 obj_08 obj_01)))
)
)

; plan
1. (op_1 obj_05 obj_04 obj_07 obj_06)
   deleted: (pred_2 obj_04 obj_07) (pred_3 obj_05 obj_06)
   added: (pred_4 obj_05 obj_04 obj_06)
   goals met: 0 of 3
2. (op_1 obj_08 obj_03 obj_07 obj_10)
   deleted: (pred_2 obj_03 obj_07) (pred_3 obj_08 obj_10)
   added: (pred_4 obj_08 obj_03 obj_10)
   goals met: 0 of 3
3. (op_2 obj_05 obj_07 obj_02)
   deleted: (pred_1 obj_05 obj_07)
   added: (pred_1 obj_05 obj_02)
   goals met: 0 of 3
4. (op_3 obj_05 obj_04 obj_02 obj_06)
   deleted: (pred_4 obj_05 obj_04 obj_06)
   added: (pred_2 obj_04 obj_02) (pred_3 obj_05 obj_06)
   goals met: 1 of 3
5. (op_2 obj_05 obj_02 obj_01)
   deleted: (pred_1 obj_05 obj_02)
   added: (pred_1 obj_05 obj_01)
   goals met: 1 of 3
6. (op_1 obj_05 obj_12 obj_01 obj_06)
   deleted: (pred_2 obj_12 obj_01) (pred_3 obj_05 obj_06)
   added: (pred_4 obj_05 obj_12 obj_06)
   goals met: 1 of 3
7. (op_2 obj_05 obj_01 obj_07)
   deleted: (pred_1 obj_05 obj_01)
   added: (pred_1 obj_05 obj_07)
   goals met: 1 of 3
8. (op_3 obj_05 obj_12 obj_07 obj_06)
   deleted: (pred_4 obj_05 obj_12 obj_06)
   added: (pred_2 obj_12 obj_07) (pred_3 obj_05 obj_06)
   goals met: 2 of 3
9. (op_3 obj_08 obj_03 obj_07 obj_10)
   deleted: (pred_4 obj_08 obj_03 obj_10)
   added: (pred_2 obj_03 obj_07) (pred_3 obj_08 obj_10)
   goals met: 2 of 3
10. (op_1 obj_05 obj_03 obj_07 obj_06)
   deleted: (pred_2 obj_03 obj_07) (pred_3 obj_05 obj_06)
   added: (pred_4 obj_05 obj_03 obj_06)
   goals met: 2 of 3
11. (op_2 obj_05 obj_07 obj_01)
   deleted: (pred_1 obj_05 obj_07)
   added: (pred_1 obj_05 obj_01)
   goals met: 2 of 3
12. (op_3 obj_05 obj_03 obj_01 obj_06)
   deleted: (pred_4 obj_05 obj_03 obj_06)
   added: (pred_2 obj_03 obj_01) (pred_3 obj_05 obj_06)
   goals met: 3 of 3
